import re

test_sentences = [
    '낑김현상이 있어요',
    '이벤 없나',
    '재접속을 해도 안되요',
    '연금술사는 어렵네요',
    '정재우 케릭터 안녕하세요',
    '이런.. 재원이 없네',
    '아놔 게임은 짱나네',
    '왜케 졸려요. 겜 정말 game재미없네',
    '왜케 졸려요. 정말 재미없네'
]

find_key_dic = {
    '낑김현상': ['낑김'],
    '이벤트': ['이벤'],
    '재접속': ['재접'],
    '용사님': ['용사'],
    '케릭터': ['케', '캐릭터', '캐', '캐릭', '케릭'],
    '케릭': ['케', '캐', '캐릭', '케릭'],
    '캐릭터': ['케', '케릭터', '캐', '캐릭', '케릭'],
    '캐릭': ['케', '캐', '캐릭', '케릭'],
    '연금술사': ['연금'],
    '악세서리': ['악세', '액세서리'],
    '액세서리': ['악세', '악세서리'],
    '전투력': ['투력'],
    '체력': ['피'],
    '서버': ['섭', '서ㅂ버']
}

equal_list_dic = {
    '레벨|렙|Lv|Level|level|lv.|lv|Lv|lvl': ['레벨', '렙', 'Lv', 'Level', 'level', 'lv.', 'lv', 'Lv.', 'lvl'],
    '유저|일반 유저|플레이어': ['유저', '일반 유저', '플레이어'],
    '장비|아이템|무기|세트|아이템 도감|도감|재료템|영탬|일탬|희탬|전설탬|갑옷|장갑|신발|장구류': ['장비', '아이템', '무기', '세트', '아이템 도감', '도감', '재료템', '영탬', '일탬',
                                                             '희탬', '전설탬', '갑옷', '장갑', '신발', '장구류'],
    '겜|게임|game': ['겜', '게임', 'game'],
    '자원|재원': ['자원', '재원'],
    '쿨타임|쿨탐': ['쿨타임', '쿨탐'],
    '검-사|검사': ['검-사', '검사'],
    '숙련자|숙련유저': ['숙련자', '숙련유저'],
    '초보|쪼렙|신생유저|신입생|신규유저|뉴비': ['초보', '쪼렙', '신생유저', '신입생', '신규유저', '뉴비'],
    '무과금|소과금|무과소과금|무과': ['무과금', '소과금', '무과소과금', '무과'],
    '과금|헤비과금러|과금 유저|과금러|핵과금러': ['과금', '헤비과금러', '과금 유저', '과금러', '핵과금러'],
    '파티|팟|팀|파티플레이|협|협동 친구|협동친구|동맹': ['파티', '팟', '팀', '파티플레이', '협', '협동 친구', '협동친구', '동맹'],
    '파티사냥|협동플레이': ['파티사냥', '협동플레이'],
    '솔로사냥|솔사냥|솔플': ['솔로사냥', '솔사냥', '솔플'],
    '직업|좝': ['직업', '좝'],
    '영웅|희귀|일반|전설': ['영웅', '희귀', '일반', '전설'],
    '길마|길드 마스터|길드장': ['길마', '길드 마스터', '길드장'],
    '레어템|레어 템': ['레어템', '레어 템'],
    '접률|접속률': ['접률', '접속률'],
    '팅김|렉|튕김': ['팅김', '렉', '튕김'],
    '힐량|딜량|딜량탱': ['힐량', '딜량', '딜량탱'],
    '무기창고|창고|템창고|인벤토리': ['무기창고', '창고', '템창고', '인벤토리'],
    '무과금 유저|무과소과금 유저|무과금러': ['무과금 유저', '무과소과금 유저', '무과금러'],
    '데미지|댐지': ['데미지', '댐지'],
    '출석체크|출첵': ['출석체크', '출첵'],
    '사제|무사|도적|궁수|궁수케릭|권술사|엘린|권사|창기|창기사|술사|광전사': ['사제', '무사', '도적', '궁수', '궁수케릭', '권술사', '엘린', '권사', '창기', '창기사', '술사',
                                                 '광전사'],
    '아이폰|아이폰5|아이폰6|아이폰7|아이폰8|아이폰x|안드로이드폰|겔럭시': ['아이폰', '아이폰5', '아이폰6', '아이폰7', '아이폰8', '아이폰x', '안드로이드폰', '겔럭시'],
    '매크로|자동사냥|자동 사냥|자동': ['매크로', '자동사냥', '자동 사냥', '자동'],
    '렙업|랩업': ['렙업', '랩업'],
    '본캐|본계|본계정|본 계정': ['본캐', '본계', '본계정', '본 계정'],
    '부캐|부계|부계정|부 계정|부케': ['부캐', '부계', '부계정', '부 계정', '부케'],
    '길드원|길원': ['길드원', '길원'],
    '공격|방어': ['공격', '방어'],
    '탱커|힐러|딜러|원딜|근딜': ['탱커', '힐러', '딜러', '원딜', '근딜'],
    '물약|포션': ['물약', '포션'],
    '장비던전|요일던전|골드던전|자동던전': ['장비던전', '요일던전', '골드던전', '자동던전'],
    '카카오|까까오': ['카카오', '까까오'],
    '린2|리니지2|액스|리니지M|리니지엠|테라|영군|영웅의 군단|리니지 레볼루션':['린2','리니지2','액스','리니지M','리니지엠','테라','영군','영웅의 군단','리니지 레볼루션']
}




def replaceNounFromContents(contents):
    add_generator_list = []

    find_keylist = '|'.join(find_key_dic.keys())

    for one_sentence in contents:
        if re.search(find_keylist, one_sentence):
            for one_key in find_key_dic.keys():
                if re.search(one_key, one_sentence):
                    for one_replace_value in find_key_dic[one_key]:
                        add_generator_list.append(re.sub(one_key, one_replace_value, one_sentence))
        for one_key in equal_list_dic.keys():
            if re.search(one_key, one_sentence):
                one_list = equal_list_dic[one_key]
                for one_item in one_list:
                    find_str = '|'.join(list(set(one_list) - {one_item}))
                    replace_str = one_item

                    if re.search(find_str, one_sentence):
                        add_generator_list.append(re.sub(find_str, replace_str, one_sentence))

    print(add_generator_list)
    return add_generator_list


if __name__ == '__main__':
    replaceNounFromContents(test_sentences)